01Hub/fbedit/BoatNavBluetooth/STM32_Sonar/main.c
void TrimOutput(void)
{
  u16 Trim;
  u16 TrimAdd;
  vu32 i;

  /* Trim echo output to near zero */
  Trim = (u16)0x400;
  TrimAdd = (u16)0x200;
  while (TrimAdd)
  {
    DAC->DHR12R2 = Trim;
    i = 10000;
    while (i--);
    if (GetADCValue(ADC_Channel_3)>32)
    {
      Trim += TrimAdd;
    }
    else
    {
      Trim -= TrimAdd;
    }
    TrimAdd = TrimAdd / 2;
  }
}

u8 StrCmp(u8 *str,u8 *comp)
{
  u8 c;
  while ((c = *comp++))
  {
    c = c - *str;
    if (c)
    {
      break;
    }
    *str++;
  }
  return c;
}

vu16 ParseSkip(vu16 GPSStart)
{
  while (STM32_Sonar.GPSArray[GPSStart] != 0x2C && STM32_Sonar.GPSArray[GPSStart] != 0x0D)
  {
    GPSStart++;
    GPSStart &= (MAXGPS - 1);
  }
  if (STM32_Sonar.GPSArray[GPSStart] == 0x2C)
  {
    GPSStart++;
    GPSStart &= (MAXGPS - 1);
  }
  return GPSStart;
}

vu16 ParseGetItem(vu16 GPSStart,u8 *item)
{
  while (STM32_Sonar.GPSArray[GPSStart] != 0x2C && STM32_Sonar.GPSArray[GPSStart] != 0x0D)
  {
    *item = STM32_Sonar.GPSArray[GPSStart];
    item++;
    GPSStart++;
    GPSStart &= (MAXGPS - 1);
  }
  *item = 0;
  if (STM32_Sonar.GPSArray[GPSStart] == 0x2C)
  {
    GPSStart++;
    GPSStart &= (MAXGPS - 1);
  }
  return GPSStart;
}

vu32 ParseDecToBin(u8 *item)
{
  u8 c;
  vu32 val = 0;
  while (c = *item++)
  {
    if (c != 0x2E)
    {
      val *= 10;
      val += (c & 0x0F);
    }
  }
  return val;
}

vu32 ParseLat(u8 *item)
{
  vu32 val;
  val = (ParseDecToBin((u8 *)&item[2]) * 100) / 60;
  item[2] = 0;
  return ParseDecToBin((u8 *)item) * 1000000 + val;
}

vu32 ParseLon(u8 *item)
{
  vu32 val;
  val = (ParseDecToBin((u8 *)&item[3]) * 100) / 60;
  item[3] = 0;
  return ParseDecToBin((u8 *)item) * 1000000 + val;
}

/*
eg3. $GPRMC,220516,A,5133.82,N,00042.24,W,173.8,231.8,130694,004.2,W
              1    2    3    4    5     6    7    8      9     10  11

      1   220516     Time Stamp
      2   A          validity - A-ok, V-invalid
      3   5133.82    current Latitude
      4   N          North/South
      5   00042.24   current Longitude
      6   W          East/West
      7   173.8      Speed in knots
      8   231.8      True course
      9   130694     Date Stamp
      10  004.2      Variation
      11  W          East/West
*/
void ParseGPRMC(vu16 GPSStart)
{
  u8 itemtime[32];
  u8 item[32];
  GPSStart = ParseSkip(GPSStart);
  GPSStart = ParseGetItem(GPSStart,(u8 *)&itemtime);  // Time Stamp
  GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // validity - A-ok, V-invalid
  if (item[0] == 'A')
  {
    if (STM32_SonarData.Altitude.fixquality == 0)
    {
      STM32_SonarData.Altitude.fixquality = 1;
    }
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // current Latitude
    STM32_SonarData.iLat = ParseLat((u8 *)&item);
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // North/South
    if (item[0] == 'S')
    {
      STM32_SonarData.iLat = -STM32_SonarData.iLat;
    }
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // current Longitude
    STM32_SonarData.iLon = ParseLon((u8 *)&item);
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // East/West
    if (item[0] == 'W')
    {
      STM32_SonarData.iLon = -STM32_SonarData.iLon;
    }
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // Speed in knots
    STM32_SonarData.iSpeed = ParseDecToBin((u8 *)&item);
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // True course
    STM32_SonarData.iBear = ParseDecToBin((u8 *)&item) / 10;
  }
  else
  {
    STM32_SonarData.Altitude.fixquality = 0;
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // current Latitude
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // North/South
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // current Longitude
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // East/West
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // Speed in knots
    GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // True course
  }
  GPSStart = ParseGetItem(GPSStart,(u8 *)&item);      // Date Stamp
	// YYYYYYYMMMMDDDDDHHHHHMMMMMMSSSSS
	// 00100100000000000000000000011111
  /* Date */
  STM32_SonarData.iTime = ParseDecToBin((u8 *)&item[4]) << 25;
  item[4] = 0;
  STM32_SonarData.iTime |= ParseDecToBin((u8 *)&item[2]) << 21;
  item[2] = 0;
  STM32_SonarData.iTime |= ParseDecToBin((u8 *)&item) << 16;
  /* Time */
  itemtime[6] = 0;
  STM32_SonarData.iTime |= ParseDecToBin((u8 *)&itemtime[4]) >> 1;
  itemtime[4] = 0;
  STM32_SonarData.iTime |= ParseDecToBin((u8 *)&itemtime[2]) << 5;
  itemtime[2] = 0;
  STM32_SonarData.iTime |= ParseDecToBin((u8 *)&itemtime[0]) << 11;
}

/*
eg. $GPGSV,3,1,11,03,03,111,00,04,15,270,00,06,01,010,00,13,06,292,00
    $GPGSV,3,2,11,14,25,170,00,16,57,208,39,18,67,296,40,19,40,246,00
    $GPGSV,3,3,11,22,42,067,42,24,14,311,43,27,05,244,00,,,,

    $GPGSV,1,1,13,02,02,213,,03,-3,000,,11,00,121,,14,13,172,05

    1    = Total number of messages of this type in this cycle
    2    = Message number
    3    = Total number of SVs in view
    4    = SV PRN number
    5    = Elevation in degrees, 90 maximum
    6    = Azimuth, degrees from true north, 000 to 359
    7    = SNR, 00-99 dB (null when not tracking)
    8-11 = Information about second SV, same as field 4-7
    12-15= Information about third SV, same as field 4-7
    16-19= Information about fourth SV, same as field 4-7
*/
void ParseGPGSV(vu16 GPSStart)
{
  u8 item[32];
  GPSStart = ParseSkip(GPSStart);
}

/*
eg3. $GPGGA,hhmmss.ss,llll.ll,a,yyyyy.yy,a,x,xx,x.x,x.x,M,x.x,M,x.x,xxxx

    1    = UTC of Position
    2    = Latitude
    3    = N or S
    4    = Longitude
    5    = E or W
    6    = GPS quality indicator (0=invalid; 1=GPS fix; 2=Diff. GPS fix)
    7    = Number of satellites in use [not those in view]
    8    = Horizontal dilution of position
    9    = Antenna altitude above/below mean sea level (geoid)
    10   = Meters  (Antenna height unit)
    11   = Geoidal separation (Diff. between WGS-84 earth ellipsoid and
           mean sea level.  -=geoid is below WGS-84 ellipsoid)
    12   = Meters  (Units of geoidal separation)
    13   = Age in seconds since last update from diff. reference station
    14   = Diff. reference station ID#
*/
void ParseGPGGA(vu16 GPSStart)
{
  u8 item[32];
  GPSStart = ParseSkip(GPSStart);
}

