01Hub/fbedit/BoatNavBluetooth/STM32_Sonar/main.c
/*
eg1. $GPGSA,A,3,,,,,,16,18,,22,24,,,3.6,2.1,2.2
eg2. $GPGSA,A,3,19,28,14,18,27,22,31,39,,,,,1.7,1.0,1.3

    1    = Mode:
           M=Manual, forced to operate in 2D or 3D
           A=Automatic, 3D/2D
    2    = Mode:
           1=Fix not available
           2=2D
           3=3D
    3-14 = IDs of SVs used in position fix (null for unused fields)
    15   = PDOP
    16   = HDOP
    17   = VDOP
*/
void ParseGPGSA(vu16 GPSStart)
{
  u8 item[32];
  GPSStart = ParseSkip(GPSStart);
}

vu32 ParseGPS(void)
{
  vu16 GPSStart = -1;
  vu16 GPSEnd = -1;
  vu16 i = STM32_Sonar.GPSTail;
  while (i != STM32_Sonar.GPSHead)
  {
    if (STM32_Sonar.GPSArray[i] == 0x0D)
    {
      GPSEnd = i;
      i = STM32_Sonar.GPSTail;
      while (i != GPSEnd)
      {
        if (STM32_Sonar.GPSArray[i] == 0x24)
        {
          GPSStart = i;
          if (StrCmp((u8*)&STM32_Sonar.GPSArray[GPSStart],(u8*)szGPRMC) == 0)
          {
            ParseGPRMC(GPSStart);
          }
          // else if (StrCmp((u8*)&STM32_Sonar.GPSArray[GPSStart],(u8*)szGPGSV) == 0)
          // {
            // ParseGPGSV(GPSStart);
          // }
          // else if (StrCmp((u8*)&STM32_Sonar.GPSArray[GPSStart],(u8*)szGPGGA) == 0)
          // {
            // ParseGPGGA(GPSStart);
          // }
          // else if (StrCmp((u8*)&STM32_Sonar.GPSArray[GPSStart],(u8*)szGPGSA) == 0)
          // {
            // ParseGPGSA(GPSStart);
          // }
          break;
        }
        i++;
        i &= (MAXGPS - 1);
      }
      GPSEnd++;
      GPSEnd &= (MAXGPS - 1);
      STM32_Sonar.GPSTail = GPSEnd;
      break;
    }
    i++;
    i &= (MAXGPS - 1);
  }
  return GPSStart;
}

void GetEcho(void)
{
  u32* ADC;
  u8 Echo;

  /* Get pointer to injected channel */
  ADC = ( (u32 *) ADC1_ICDR_Address);
  while (STM32_Sonar.Start)
  {
    /* To eliminate the need for an advanced AM demodulator the largest */ 
    /* ADC reading is stored in its echo array element */
    /* Get echo */
    Echo = ( (*(u32*) (((*(u32*)&ADC)))) >> 4);
    /* If echo larger than previous echo then update the echo array */
    if (Echo > STM32_SonarData.EchoArray[STM32_Sonar.EchoIndex])
    {
      STM32_SonarData.EchoArray[STM32_Sonar.EchoIndex] = Echo;
    }
  }
}

/*******************************************************************************
* Function Name  : GetADCValue
* Description    : This function sums 16 ADC conversions and returns the average.
* Input          : ADC channel
* Output         : None
* Return         : The ADC cannel reading
*******************************************************************************/
u16 GetADCValue(u8 Channel)
{
  vu8 i;
  vu16 ADCValue;
  ADC_InitTypeDef ADC_InitStructure;

  ADCValue = 0;
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
  /* ADC1 regular channel configuration */ 
  ADC_RegularChannelConfig(ADC1, Channel, 1, ADC_SampleTime_239Cycles5);
  /* Start ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  /* Add 16 conversions to reduce thermal noise */
  i = 16;
  while (i--)
  {
    ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
    while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET)
    {
    }
    ADCValue += ADC1->DR;
  }
  /* Stop ADC1 Software Conversion */ 
  ADC_SoftwareStartConvCmd(ADC1, DISABLE);
  /* Return average of the 16 added conversions */
  return (ADCValue >> 4);
}

/*******************************************************************************
* Function Name  : GainSetup
* Description    : This function sets up the gain levels for each pixel
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GainSetup(void)
{
  vu32 GainInitInx;
  vu32 i;
  vu32 GainInx;
  vu32 GainInc;
  vu32 GainVal;
  GainInitInx=1;
  GainInx=0;
  while (GainInitInx<17)
  {
    GainVal=STM32_Sonar.GainInit[GainInitInx]<<13;
    GainInc=(STM32_Sonar.GainInit[GainInitInx+1]-STM32_Sonar.GainInit[GainInitInx])<<8;
    i=0;
    while (i<32)
    {
      STM32_Sonar.GainArray[GainInx]=(GainVal>>13)+STM32_Sonar.GainInit[0];
      if ((GainVal>>12) && 1)
      {
        STM32_Sonar.GainArray[GainInx]++;
      }
      if (STM32_Sonar.GainArray[GainInx]>4095)
      {
        STM32_Sonar.GainArray[GainInx]=4095;
      }
      GainVal+=GainInc;
      GainInx++;
      i++;
    }
    GainInitInx++;
  }
}

/*******************************************************************************
* Function Name  : TIM1_UP_IRQHandler
* Description    : This function handles TIM1 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM1_UP_IRQHandler(void)
{
  /* Set ping outputs high (FET's off) */
  GPIOA->BSRR = (u16) (GPIO_Pin_2 | GPIO_Pin_1);
  if (STM32_Sonar.PingPulses)
  {
    GPIOA->ODR = Ping;
    if (Ping == 0x2)
    {
      Ping = 0x4;     // PA02
    }
    else
    {
      Ping = 0x2;     // PA01
      STM32_Sonar.PingPulses--;
    }
  }
  else
  {
    /* Ping done, Disable TIM1 */
    TIM_Cmd(TIM1, DISABLE);
    /* TIM2 configuration */
    TIM2_Configuration();
    /* Clear TIM2 Update interrupt pending bit */
    TIM2->SR = (u16)~TIM_IT_Update;
    /* Enable TIM2 */
    TIM_Cmd(TIM2, ENABLE);
    /* Enable the USART1 Receive interrupt: this interrupt is generated when the 
       USART1 receive data register is not empty */
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
  }
  /* Clear TIM1 Update interrupt pending bit */
  TIM1->SR = (u16)~TIM_IT_Update;
}

